import '../css/story.css';


function Story() {
  return (
    <div className="Story">
      <div className="topic"> <p>STORY</p> </div>
      <div className="StoryFrame">
        <div className="Content">
        <h5>เทศกาลเจ เริ่มขึ้นเมื่อประมาณ 400 ปีมาแล้วในประเทศจีน</h5> 
        <h5>เกิดขึ้นในสมัยที่ชาวจีนถูกแมนจูเข้ามาปกครอง และบังคับชนชาติจีนยอมรับวัฒนธรรมของตน</h5>
        <h5>สมัยนั้นเองมีคนจีนกลุ่มหนึ่งรวมตัวกันต่อต้านแมนจูโดยใช้หลักทางธรรมเข้าร่วมด้วย</h5>
        <h5>ชาวจีนกลุ่มนี้นุ่งขาว ห่มขาว และไม่รับประทานเนื้อสัตว์ ตามความเชื่อว่า การประพฤติปฏิบัติ</h5>
        <h5>ตามแนวทางนี้จะช่วยสร้างความเข้มแข็งให้กับตนเองได้คนกลุ่มนี้เรียกตัวเองว่า “หงี่หั่วท้วง” </h5>
      </div>
      </div>
    </div>
  );
}

export default Story;